[
  {
    "companyTitle": "Weaviate",
    "companyImg": "/svg/weaviate.svg",
    "companyURL": "https://weaviate.io/",
    "title": "Senior Software Engineer",
    "period": "April 2025 - Current",
    "type": "Full-Time",
    "location": "Paris, France",
    "achievements": [
      "Own backend features end-to-end, collaborating across teams for alignment and transparency.",
      "Contribute to incident response, ensuring reliability and clear communication.",
      "Maintain database backups and alerting to ensure cluster health.",
      "Build frontend integrations that expose backend features to cloud users.",
      "Promote AI-powered tools and workflows to boost team efficiency."
    ],
    "kpis": []
  },
  {
    "companyTitle": "Kardinal AI",
    "companyImg": "/svg/kardinal.svg",
    "companyURL": "https://kardinal.ai/",
    "title": "Senior Backend Engineer",
    "period": "March 2021 - March 2025",
    "type": "Full-Time",
    "location": "Paris, France",
    "achievements": [
      "Built and managed various efficient microservices in Go, including APIs and KPI tracking.",
      "Owned and maintained crucial internal libraries, ensuring seamless integration across projects.",
      "Optimized a critical API, achieving a remarkable 70% performance improvement.",
      "Provided critical analysis and benchmarking to support better technological decisions.",
      "Mentored and empowered junior developers to rapidly grasp our internal stack and contribute effectively to projects."
    ],
    "kpis": [
      {
        "title": "Libraries",
        "kpi": "7",
        "description": "Created & Maintained"
      },
      {
        "title": "Microservices",
        "kpi": "12",
        "description": "Created & Maintained"
      },
      {
        "title": "APIs",
        "kpi": "+100",
        "description": "Developed"
      }
    ]
  },
  {
    "companyTitle": "Polar Stork",
    "companyImg": "/svg/polarstork.svg",
    "companyURL": "https://polarstork.com/",
    "title": "Full-Stack Software Engineer",
    "period": "May 2019 - April 2021",
    "type": "Full-Time",
    "location": "Remote, US",
    "achievements": [
      "Developed full-stack web and mobile apps across diverse industries, from concept to deployment.",
      "Led a team as Technical Lead for a VoIP mobile app supporting the Lebanese Red Cross during the pandemic.",
      "Influenced technology stack and system architecture decisions based on project requirements and goals.",
      "Introduced and championed Flutter adoption, enhancing development efficiency and cross-platform capabilities.",
      "Shared Flutter expertise with fellow developers, enabling them to overcome challenges and contribute effectively to project goals."
    ],
    "kpis": [
      {
        "title": "Projects",
        "kpi": "7",
        "description": "Contributor"
      },
      {
        "title": "Projects",
        "kpi": "2",
        "description": "Lead"
      },
      {
        "title": "Technologies",
        "kpi": "10",
        "description": "Used"
      }
    ]
  },
  {
    "companyTitle": "InnTrend",
    "companyImg": "/images/inntrend.jpg",
    "companyURL": "https://www.facebook.com/inntrends/",
    "title": "Founding Software Engineer",
    "period": "January 2017 - January 2019",
    "type": "Contract",
    "location": "Beirut, Lebanon",
    "achievements": [
      "Managed the entire software development process for a Quality Management platform.",
      "Designed and maintained the backend API using Spring Boot, ensuring smooth communication with the frontend.",
      "Developed and maintained the web application in Angular 6, enhancing user experience and interface design.",
      "Participated in business meetings and client calls to understand technical challenges."
    ],
    "kpis": []
  }
]
